In [3]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [6]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [8]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [9]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [13]:
data = DataFrame(np.arange(16).reshape((4,4)), 
                index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                columns = ['one', 'two', 'three', 'four'])

In [14]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [15]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [16]:
data.drop('two', axis=1) # Specify with axis =1  ( columnwise selection)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [17]:
data.drop(['two', 'four'], axis = 1) #group of index, columns : with list.

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [ ]:
obj = Series(np.arange(4. ), index = ['a', 'b', 'c', 'd'])

obj['b']

In [25]:
#Indexing, Selection, Filtering

obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b'], obj[1]

(1.0, 1.0)

In [26]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [27]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [28]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [23]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [29]:
obj[obj <2]

a    0.0
b    1.0
dtype: float64

In [35]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [34]:
obj[1:2]

b    1.0
dtype: float64

In [36]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [37]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [38]:
data = DataFrame(np.arange(16).reshape((4,4)), 
                index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                columns = ['one', 'two', 'three', 'four'])

In [39]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [40]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [41]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [48]:
#Exceptional Cases. Selecting rows by slicing #:# , boolean array -> regarded as selecting rows
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [49]:
data[data['three'] > 5 ]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [50]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [51]:
data[data<5] = 0

In [52]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [53]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [56]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [61]:
data.ix[ ['Colorado', 'Utah'], [3,0,1] ]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [62]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [63]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [64]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [65]:
data.ix[data.three >5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [66]:
data.ix[2] #select row

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [70]:
#selection by  slicing : maintain dataframe.
type(data[2:3])
#selection by ix(loc,iloc) : drop dataframe if possible(Series)
type(data.ix[2])

pandas.core.series.Series

In [73]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [119]:
#Arithmetic and Data Alignment
s1 = Series( np.random.uniform(-10,10,20), index = map(chr,np.random.randint(65, 91, 20)) )
s1

Z    8.248081
A    7.698263
O    9.563603
P    8.735160
I    5.058134
X   -7.482882
D    0.452132
O   -4.378012
U   -1.780961
F   -5.420907
B    8.725382
M    0.253759
L    2.047412
N    6.072324
Q    4.132846
U    8.289241
S    4.860086
U   -2.611964
M   -3.742456
H    5.683324
dtype: float64

In [120]:
s2 = Series(np.random.uniform(-10,10,20), index = map(chr, np.random.randint(65,91, 20)) )
s2

J    5.289756
B    1.592886
E   -6.214398
F    7.024259
R   -7.604867
A   -9.839159
X   -1.548484
J   -1.171719
S   -1.884863
H   -2.917739
Q    8.278967
N   -4.872415
O   -3.479132
A    3.383802
H    5.896397
W   -4.649080
T   -2.733556
L   -5.859465
T   -1.757099
M   -5.888627
dtype: float64

In [121]:
s1 + s2

A    -2.140896
A    11.082064
B    10.318268
D          NaN
E          NaN
F     1.603352
H     2.765585
H    11.579720
I          NaN
J          NaN
J          NaN
L    -3.812054
M    -5.634868
M    -9.631083
N     1.199909
O     6.084471
O    -7.857144
P          NaN
Q    12.411813
R          NaN
S     2.975222
T          NaN
T          NaN
U          NaN
U          NaN
U          NaN
W          NaN
X    -9.031366
Z          NaN
dtype: float64

In [93]:
df1 = 

#help(np.random.uniform)
chr(48)
ord('A')

65

In [102]:
for i,j in enumerate(range(200)):
    print (i, chr(i)) # 65~90 65,91 / 97, 123

0  
1 
2 
3 
4 
5 
6 
7 
8 
9
10

11
12
13
14 
15 
16 
17 
18 
19 
20 
21 
22 
23 
24 
25 
26 
27 
28
29
30
31
32
33 !
34 "
35 #
36 $
37 %
38 &
39 '
40 (
41 )
42 *
43 +
44 ,
45 -
46 .
47 /
48 0
49 1
50 2
51 3
52 4
53 5
54 6
55 7
56 8
57 9
58 :
59 ;
60 <
61 =
62 >
63 ?
64 @
65 A
66 B
67 C
68 D
69 E
70 F
71 G
72 H
73 I
74 J
75 K
76 L
77 M
78 N
79 O
80 P
81 Q
82 R
83 S
84 T
85 U
86 V
87 W
88 X
89 Y
90 Z
91 [
92 \
93 ]
94 ^
95 _
96 `
97 a
98 b
99 c
100 d
101 e
102 f
103 g
104 h
105 i
106 j
107 k
108 l
109 m
110 n
111 o
112 p
113 q
114 r
115 s
116 t
117 u
118 v
119 w
120 x
121 y
122 z
123 {
124 |
125 }
126 ~
127 
128 
129 
130 
131 
132 
133
134 
135 
136 
137 
138 
139 
140 
141 
142 
143 
144 
145 
146 
147 
148 
149 
150 
151 
152 
153 
154 
155 
156 
157 
158 
159 
160
161 ¡
162 ¢
163 £
164 ¤
165 ¥
166 ¦
167 §
168 ¨
169 ©
170 ª
171 «
172 ¬
173 ­
174 ®
175 ¯
176 °
177 ±
178 ²
179 ³
180 ´
181 µ
182 ¶
183 ·
184 ¸
185 ¹
186 º
187 »
188 ¼
189 ½
190 ¾
191 ¿
192 À
193 Á
194 Â
195 Ã
196 Ä
197 Å
198 Æ
199 Ç

In [104]:
np.random.uniform(-10,10,5)

array([-7.94305205,  3.77151927, -4.17751742, -1.20379663, -8.24563021])

In [111]:
list(map(chr,np.random.randint(65, 91, 5)))

['Y', 'H', 'O', 'Y', 'U']

In [125]:
df1 = DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'),
               index = ['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [126]:
df2 = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [127]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [128]:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))

df2 = DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))

In [135]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [136]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [137]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN